app/Controllers/Admin/CategoriasController.php

SELECT *
FROM `categorias`
WHERE `categorias`.`id` = '4'
---
    public function editar($id)
    {
        $categoria = $this->categoriaModel->find($id);

SELECT `categorias`.*, COUNT(productos.id) as productos_count
FROM `categorias`
LEFT JOIN `productos` ON `productos`.`categoria_id` = `categorias`.`id`
GROUP BY `categorias`.`id`
ORDER BY `categorias`.`nombre`
---
    public function getCategoriasAdmin()
    {
        $ajaxValidation = $this->validateAjaxRequest();
        if ($ajaxValidation) return $ajaxValidation;

        try {
            // Obtener categorías con conteo de productos
            $categorias = $this->categoriaModel
                ->select('categorias.*, COUNT(productos.id) as productos_count')
                ->join('productos', 'productos.categoria_id = categorias.id', 'left')
                ->groupBy('categorias.id')
                ->orderBy('categorias.nombre')
                ->findAll();

SELECT *
FROM `categorias`
WHERE `categorias`.`id` = '5'
---
    public function getCategoria($id)
    {
        $ajaxValidation = $this->validateAjaxRequest();
        if ($ajaxValidation) return $ajaxValidation;

        try {
            $categoria = $this->categoriaModel->find($id);

SELECT *
FROM `categorias`
WHERE `categorias`.`id` = '5'
---
    public function actualizarCategoria($id)
    {
        $ajaxValidation = $this->validateAjaxRequest();
        if ($ajaxValidation) return $ajaxValidation;

        try {
            $categoria = $this->categoriaModel->find($id);

UPDATE `categorias` SET `nombre` = 'Cafe prueba prueba', `descripcion` = 'esto es una prueba', `activa` = 1, `slug` = 'cafe-prueba-prueba'
WHERE `categorias`.`id` IN ('5')
---
                'activa' => isset($input['activa']) && $input['activa'] ? 1 : 0
            ];

            $success = $this->categoriaModel->update($id, $updateData);