app/Controllers/Admin/DashboardController.php

SELECT COUNT(*) AS `numrows` FROM `pedidos`
SELECT SUM(`total`) AS `total`
FROM `pedidos`
WHERE `estado` != 'cancelado'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `activo` = 1
SELECT COUNT(*) AS `numrows`
FROM `pedidos`
WHERE `estado` = 'pendiente'
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `stock` <= 'stock_minimo'
---
    public function index()
    {
        // Obtener estadísticas para el dashboard
        $totalPedidos = $this->pedidoModel->countAll();

        // Calcular ventas totales
        $ventasTotal = $this->pedidoModel->selectSum('total')
            ->where('estado !=', 'cancelado')
            ->first();

        $data = [
            'title' => 'Panel de Administración',
            'user' => $this->getAdminUserData(),
            'stats' => [
                'usuarios' => $this->usuarioModel->countAll(),
                'productos' => $this->productoModel->where('activo', true)->countAllResults(),
                'pedidos' => $totalPedidos,
                'ventas' => $ventasTotal['total'] ?? 0,
                'pedidos_pendientes' => $this->pedidoModel->where('estado', 'pendiente')->countAllResults(),
                'productos_bajo_stock' => $this->productoModel->where('stock <=', 'stock_minimo')->countAllResults()