app/Controllers/Admin/UsuariosController.php

SELECT `usuarios`.*, GROUP_CONCAT(roles.nombre) as roles_nombres
FROM `usuarios`
LEFT JOIN `usuario_roles` ON `usuario_roles`.`usuario_id` = `usuarios`.`id`
LEFT JOIN `roles` ON `roles`.`id` = `usuario_roles`.`rol_id`
GROUP BY `usuarios`.`id`
ORDER BY `usuarios`.`fecha_registro` DESC
---
    public function getUsuarios()
    {
        $ajaxValidation = $this->validateAjaxRequest();
        if ($ajaxValidation) return $ajaxValidation;

        try {
            $usuarios = $this->usuarioModel->select('usuarios.*, GROUP_CONCAT(roles.nombre) as roles_nombres')
                ->join('usuario_roles', 'usuario_roles.usuario_id = usuarios.id', 'left')
                ->join('roles', 'roles.id = usuario_roles.rol_id', 'left')
                ->groupBy('usuarios.id')
                ->orderBy('usuarios.fecha_registro', 'DESC')
                ->findAll();

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '2'
UPDATE `usuarios` SET `baja` = 'NO'
WHERE `usuarios`.`id` IN ('2')
---
    public function cambiarEstadoBajaUsuario($id)
    {
        $ajaxValidation = $this->validateAjaxRequest();
        if ($ajaxValidation) return $ajaxValidation;

        try {
            $usuario = $this->usuarioModel->find($id);
            if (!$usuario) {
                return $this->sendJsonResponse(false, 'Usuario no encontrado');
            }

            $request = service('request');
            $input = $request->getBody();
            $requestData = json_decode($input, true);
            if (!$requestData) {
                $requestData = $request->getPost();
            }
            $nuevoEstado = isset($requestData['baja']) && $requestData['baja'] === 'SI' ? 'SI' : 'NO';

            // No permitir darse de baja a sí mismo
            $session = session();
            if ($id == $session->get('id')) {
                return $this->sendJsonResponse(false, 'No puedes darte de baja a ti mismo');
            }

            $this->usuarioModel->update($id, ['baja' => $nuevoEstado]);