app/Controllers/Auth.php

SELECT *
FROM `usuarios`
WHERE `email` = 'valdes.nicoedu@gmail.com'
 LIMIT 1
---
    public function procesarLogin()
    {


        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required|min_length[6]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()
                ->withInput()
                ->with('errors', $this->validator->getErrors());
        }
        try {
            $model = new UsuarioModel();
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            // USAR VALIDACIÓN DEL MODELO PARA IMPEDIR LOGIN DE USUARIOS DADOS DE BAJA
            $user = $model->validateLogin($email, $password);

            if (!$user) {
                // Verificar si el usuario existe pero está dado de baja
                $userCheck = $model->where('email', $email)->first();