app/Models/CarritoModel.php

    public function contarItems($usuarioId)
    {
        $carrito = $this->where('usuario_id', $usuarioId)->first();
---
SELECT *
FROM `carritos`
WHERE `usuario_id` = '1'
 LIMIT 1