app/Models/ProductoModel.php

SELECT `productos`.*, `categorias`.`nombre` as `categoria_nombre`
FROM `productos`
LEFT JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
WHERE `productos`.`activo` = 1
AND `productos`.`destacado` = 1
ORDER BY `productos`.`nombre` ASC
 LIMIT 4
---
    public function obtenerProductosDestacados($limite = 4)
    {
        return $this->select('productos.*, categorias.nombre as categoria_nombre')
            ->join('categorias', 'categorias.id = productos.categoria_id', 'left')
            ->where('productos.activo', true)
            ->where('productos.destacado', true)
            ->orderBy('productos.nombre', 'ASC')
            ->limit($limite)
            ->findAll();