app/Models/UsuarioModel.php

    public function validateLogin($email, $password)
    {
        $user = $this->where('email', $email)
            ->where('baja', 'NO')
            ->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'admin@origenepuro.com'
AND `baja` = 'NO'
 LIMIT 1

    public function getUsuarioConRoles($userId)
    {
        $usuario = $this->where('id', $userId)->where('baja', 'NO')->first();
        if (!$usuario) {
            return null;
        }

        // Obtener roles del usuario usando la conexión del modelo
        $rolesQuery = $this->db->table('roles r')
            ->select('r.*')
            ->join('usuario_roles ur', 'r.id = ur.rol_id')
            ->where('ur.usuario_id', $userId)
            ->get();
---
SELECT *
FROM `usuarios`
WHERE `id` = '1'
AND `baja` = 'NO'
 LIMIT 1
SELECT `r`.*
FROM `roles` `r`
JOIN `usuario_roles` `ur` ON `r`.`id` = `ur`.`rol_id`
WHERE `ur`.`usuario_id` = '1'

    public function tieneRol($userId, $rolNombre)
    {
        $count = $this->db->table('usuario_roles ur')
            ->select('COUNT(*) as count')
            ->join('roles r', 'ur.rol_id = r.id')
            ->where('ur.usuario_id', $userId)
            ->where('r.nombre', $rolNombre)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `usuario_roles` `ur`
JOIN `roles` `r` ON `ur`.`rol_id` = `r`.`id`
WHERE `ur`.`usuario_id` = '1'
AND `r`.`nombre` = 'admin'